Revit 2026 API

# RepeaterBoundsAdjustForCyclicalBounds Method

---

Shifts the input coordinates in the cyclical dimensions so that they fall in the [lower bounds, upper bounds] range.

**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public RepeaterCoordinates AdjustForCyclicalBounds(
	RepeaterCoordinates coordinates
)
```
```vb
Public Function AdjustForCyclicalBounds (
	coordinates As RepeaterCoordinates
) As RepeaterCoordinates
```
```cpp
public:
RepeaterCoordinates^ AdjustForCyclicalBounds(
	RepeaterCoordinates^ coordinates
)
```
```fsharp
member AdjustForCyclicalBounds :
        coordinates : RepeaterCoordinates -> RepeaterCoordinates
```

#### Parameters

coordinates RepeaterCoordinates
     The coordinates.

#### Return Value

RepeaterCoordinates The adjusted coordinates.

| Exception | Condition |
| --- | --- |
| ArgumentException | The coordinates coordinates have incompatible number of dimensions. |
| ArgumentNullException | A non-optional argument was null |
| InvalidOperationException | The bounds must have at least one dimension. |

The coordinates must have the same number of dimensions as the bounds. This method does not apply to zero dimensional bounds.

#### Reference

RepeaterBounds Class

Autodesk.Revit.DB Namespace